20180724/PX4-Dev-Workshop/lesson-plan.org
# Creative Commons, Share-Alike (cc)
#+EMAIL:     dongheepark@gmail.com
#+TITLE:    PX4 개발 워크숍 
#+SUBTITLE:  세종대 유도항법제어랩
#+SETUPFILE: ../../../docs/css/theme-gongzhitaao.setup


* 워크숍 개요

 - 목표: 본 워크숍 참가자가 PX4에 대한 구조이해하고, PX4를 이용한 어플리케이션 개발을 할 수 있다. 
 - 장소: 세종대학교 충무관
 - 참가자: 박동희
 - 일시: 2018-7-25~ , 12주차. 
 - 참고: https://dh8.kr/docs/log/sejong.html

* 주계획

 - 1주차 PX4 개발환경 설치 및 소개
 - 2주차 C언어 기초1, PX4 Posix Programming
 - 3주차 C언어 기초2, PX4 Posix Programming
 - 4주차 ROS
 - 5주차 MAVLINK
 - 6주차 PX4 OFFBOARD Programming
 - 7주차 MAVROS
 - 8주차 Vision, OPENCV
 - 9주차 ROS 심화
 - 10주차 Project: Pricision Landing 개발
 - 11주차 Project: Precision Landing 개발
 - 12주차 Project: Procision Landing 비행 

* 세부 계획
** 1주차 PX4 개발환경 설치 및 소개
 - 워크숍, 참가자 소개 
 - PX4, Linux, ROS 소개 
 - PX4 Build
  - jMavSim 사용하기
 - Git 사용
 - 과제
  - dev.px4.io 질문 3
  - 리눅스 기본 명령어 정리
  - 컴파일 방법
  - C언어 형성 평가 


** 2주차 C언어 기초 1, Posix Programming
 - C언어 기초: 에러로 배우는 프로그래밍, 
 - C언어 기초: 변수, 제어구문, 반복구문
 - PX4 미들웨어 및 앱 구조 소개
 - PX4 앱 만들기 (hello-skyworld)

** 3주차 C언어 기초2, PX4 Posix Programming
 - C언어 기초: Pointer, Struct
 - Posix Programming: Open, Poll, ioctl, Close
 - PX4 앱 만들기 (토픽 구독하기)

** 4주차 ROS
 - ROS 소개, 
  - ROS미들웨어, 
  - ROS 컴포넌트 라이브러리
  - Node, Topics, Message Passing, Services
 - Hello ROS (catkin build)
 - 드론 관련 패키지 소개

** 5주차 MAVROS

** 6주차 MAVLINK
  - Mavlink 소개 
  - Mavlink 프로그래밍, SDK
   - C, Python
   - Command Message, Subscription Message
  - Simulator를 이용하여 드론 제어 
   - 모드 바꾸기, 드론 데이터 읽기

** 7주차 PX4 OFFBOARD Programming
** 8주차 Vision, OPENCV
** 9주차 ROS 심화
** 10주차 Project: Pricision Landing 개발
** 11주차 Project: Precision Landing 개발
** 12주차 Project: Procision Landing 비행 

* 수업 후 요구사항 
