20180724/PX4-Dev-Workshop/lesson-plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-25 Wed 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PX4 개발 워크숍</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Donghee Park" />
</head>
<body>
<div id="content">
<h1 class="title">PX4 개발 워크숍
<br />
<span class="subtitle">세종대 유도항법제어랩</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b865e2">1. 워크숍 개요</a></li>
<li><a href="#orgf00f3b9">2. 주계획</a></li>
<li><a href="#org7b0732e">3. 세부 계획</a>
<ul>
<li><a href="#orgd3a4d09">3.1. 1주차 PX4 개발환경 설치 및 소개</a></li>
<li><a href="#org54636b3">3.2. 2주차 C언어 기초 1, Posix Programming</a></li>
<li><a href="#org8ea2704">3.3. 3주차 C언어 기초2, PX4 Posix Programming</a></li>
<li><a href="#org20953bf">3.4. 4주차 ROS</a></li>
<li><a href="#orgbd9cfc3">3.5. 5주차 MAVLINK</a></li>
<li><a href="#org713c5b6">3.6. 6주차 PX4 OFFBOARD Programming</a></li>
<li><a href="#org94991f0">3.7. 7주차 MAVROS</a></li>
<li><a href="#org6255753">3.8. 8주차 Vision, OPENCV</a></li>
<li><a href="#org7f79b04">3.9. 9주차 ROS 심화</a></li>
<li><a href="#org45cd32a">3.10. 10주차 Project: Pricision Landing 개발</a></li>
<li><a href="#org5b91c49">3.11. 11주차 Project: Precision Landing 개발</a></li>
<li><a href="#org235b11e">3.12. 12주차 Project: Procision Landing 비행</a></li>
</ul>
</li>
<li><a href="#org6830d5e">4. 수업 후 요구사항</a></li>
</ul>
</div>
</div>


<div id="outline-container-org4b865e2" class="outline-2">
<h2 id="org4b865e2"><span class="section-number-2">1</span> 워크숍 개요</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>목표: 본 워크숍 참가자가 PX4에 대한 구조이해하고, PX4를 이용한 어플리케이션 개발을 할 수 있다.</li>
<li>장소: 세종대학교 충무관</li>
<li>참가자: 박동희</li>
<li>일시: 2018-7-25~ , 12주차.</li>
<li>참고: <a href="https://dh8.kr/docs/log/sejong.html">https://dh8.kr/docs/log/sejong.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf00f3b9" class="outline-2">
<h2 id="orgf00f3b9"><span class="section-number-2">2</span> 주계획</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>1주차 PX4 개발환경 설치 및 소개</li>
<li>2주차 C언어 기초1, PX4 Posix Programming</li>
<li>3주차 C언어 기초2, PX4 Posix Programming</li>
<li>4주차 ROS</li>
<li>5주차 MAVLINK</li>
<li>6주차 PX4 OFFBOARD Programming</li>
<li>7주차 MAVROS</li>
<li>8주차 Vision, OPENCV</li>
<li>9주차 ROS 심화</li>
<li>10주차 Project: Pricision Landing 개발</li>
<li>11주차 Project: Precision Landing 개발</li>
<li>12주차 Project: Procision Landing 비행</li>
</ul>
</div>
</div>

<div id="outline-container-org7b0732e" class="outline-2">
<h2 id="org7b0732e"><span class="section-number-2">3</span> 세부 계획</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd3a4d09" class="outline-3">
<h3 id="orgd3a4d09"><span class="section-number-3">3.1</span> 1주차 PX4 개발환경 설치 및 소개</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>워크숍, 참가자 소개</li>
<li>PX4, ROS, OpenCV 소개</li>
<li>PX4 소프트웨어 구조</li>
<li>PX4 부팅 분석</li>
<li>C언어 형성 평가</li>
</ul>
</div>
</div>

<div id="outline-container-org54636b3" class="outline-3">
<h3 id="org54636b3"><span class="section-number-3">3.2</span> 2주차 C언어 기초 1, Posix Programming</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>C언어 기초: 에러로 배우는 프로그래밍,</li>
<li>C언어 기초: 변수, 제어구문, 반복구문</li>
<li>PX4 미들웨어 및 앱 구조 소개</li>
<li>PX4 앱 만들기 (hello-skyworld)</li>
</ul>
</div>
</div>

<div id="outline-container-org8ea2704" class="outline-3">
<h3 id="org8ea2704"><span class="section-number-3">3.3</span> 3주차 C언어 기초2, PX4 Posix Programming</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>C언어 기초: Pointer, Struct</li>
<li>Posix Programming: Open, Poll, ioctl, Close</li>
<li>PX4 앱 만들기 (토픽 구독하기)</li>
</ul>
</div>
</div>

<div id="outline-container-org20953bf" class="outline-3">
<h3 id="org20953bf"><span class="section-number-3">3.4</span> 4주차 ROS</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>ROS 소개, 
<ul class="org-ul">
<li>ROS미들웨어,</li>
<li>ROS 컴포넌트 라이브러리</li>
<li>Node, Topics, Message Passing, Services</li>
</ul></li>
<li>Hello ROS (catkin build)</li>
<li>드론 관련 패키지 소개</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd9cfc3" class="outline-3">
<h3 id="orgbd9cfc3"><span class="section-number-3">3.5</span> 5주차 MAVLINK</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Mavlink 소개</li>
<li>Mavlink 프로그래밍, SDK
<ul class="org-ul">
<li>C, Python</li>
<li>Command Message, Subscription Message</li>
</ul></li>
<li>Simulator를 이용하여 드론 제어 
<ul class="org-ul">
<li>모드 바꾸기, 드론 데이터 읽기</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org713c5b6" class="outline-3">
<h3 id="org713c5b6"><span class="section-number-3">3.6</span> 6주차 PX4 OFFBOARD Programming</h3>
</div>
<div id="outline-container-org94991f0" class="outline-3">
<h3 id="org94991f0"><span class="section-number-3">3.7</span> 7주차 MAVROS</h3>
</div>
<div id="outline-container-org6255753" class="outline-3">
<h3 id="org6255753"><span class="section-number-3">3.8</span> 8주차 Vision, OPENCV</h3>
</div>
<div id="outline-container-org7f79b04" class="outline-3">
<h3 id="org7f79b04"><span class="section-number-3">3.9</span> 9주차 ROS 심화</h3>
</div>
<div id="outline-container-org45cd32a" class="outline-3">
<h3 id="org45cd32a"><span class="section-number-3">3.10</span> 10주차 Project: Pricision Landing 개발</h3>
</div>
<div id="outline-container-org5b91c49" class="outline-3">
<h3 id="org5b91c49"><span class="section-number-3">3.11</span> 11주차 Project: Precision Landing 개발</h3>
</div>
<div id="outline-container-org235b11e" class="outline-3">
<h3 id="org235b11e"><span class="section-number-3">3.12</span> 12주차 Project: Procision Landing 비행</h3>
</div>
</div>

<div id="outline-container-org6830d5e" class="outline-2">
<h2 id="org6830d5e"><span class="section-number-2">4</span> 수업 후 요구사항</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Donghee Park</p>
<p class="date">Created: 2018-07-25 Wed 14:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>